create view Статистика_Разговоров
as
SELECT        dbo.[Телефоны абонентов].НомерТелефона, dbo.Абоненты.Фамилия + ' ' + dbo.Абоненты.Имя + ' ' + dbo.Абоненты.Отчество AS [ФИО абонента], COUNT(dbo.Звонки.IdТелеАбон) AS [Кол_во звонков]
FROM            dbo.Абоненты INNER JOIN
                         dbo.[Телефоны абонентов] ON dbo.Абоненты.IdАбонента = dbo.[Телефоны абонентов].IdАбонента INNER JOIN
                         dbo.Звонки ON dbo.Звонки.IdТелеАбон = dbo.[Телефоны абонентов].IdТелеАбон
GROUP BY dbo.[Телефоны абонентов].НомерТелефона, dbo.Абоненты.Фамилия + ' ' + dbo.Абоненты.Имя + ' ' + dbo.Абоненты.Отчество, dbo.Звонки.IdТелеАбон